import React from 'react'
import styled from "@emotion/styled";
import {useDocumentTitle} from "@/utils";


export const CustomerAgreement = () =>{
    useDocumentTitle("用户协议");
    return (
        <Container>
             <h2 style={{textAlign: 'center'}}>用户协议</h2>
            感谢您使用念熹智语(NX)，这是一项由北京念熹网络科技有限公司提供的文本纠错、改写及自动生成服务。《念熹智语用户协议》（“本协议”）系由用户（“用户”或“您”）与北京念熹网络科技有限公司（“念熹科技”或“我们”）就用户使用念熹网络科技提供的上述服务所订立的协议。
            <br/>
            <br/>
            通过访问平台或使用服务，您承认您已仔细阅读和理解本协议的所有条款和条件以及平台所包含的其他指引、规则、政策（统称“条款”），并同意受其约束。
            <b>请您特别注意仔细阅读服务条款中关于免除或者限制责任的条款、法律使用和争议解决条款等。</b>如果您不同意任何服务条款，则您有权停止访问平台和使用服务。
            <br/>
            <br/>
            <h4>1. 帐号</h4>
            1.1. 平台为您提供了注册通道，您有权选择合法的字符组合作为自己的账号， 并自行设置符合安全要求的密码。用户设置的账号、密码是用户用以登录平台并使用服务的凭证。
            <br/>
            <br/>

            1.2. 您理解并承诺，您所设置的账号不得违反国家法律法规及平台的相关规则，不得实施任何侵害国家利益、损害其他公民合法权益，有害社会道德风尚的 行为，您的账号名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）开设账号，不得恶意注册账号（包括但不限于频繁注册、批量注册账号等行为）；并且，在注册账号时，您提供的个人信息应当合法、真实且有效。我们有权对您提交的信息进行审核。
            <br/>
            <br/>

            1.3. 您的账号仅限于您本人使用，未经念熹科技书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果念熹科技发现或者有合理理由认为使用者并非账号初始注册人，为保障账号安全，念熹科技有权立即暂停或终止向该注册账号提供服务，或注销该账号。
            <br/>
            <br/>

            1.4. 您有责任维护个人账号、密码的安全性与保密性，并对您以注册账号名义所从事的活动承担全部法律责任。
            <br/>
            <br/>
            1.5. 如果您认为您的密码或者访问您账号的其他方式已经泄露，丢失或被盗，或者认为某一未授权个人正在或可能试图通过您的账号登录平台或使用服务， 请务必立即发送电子邮件至 Support@nianxi.cc或致念熹科技。
            <br/>
            <br/>
            <h4>2.授权使用及限制</h4>
            2.1. 平台内容。平台及其平台所包含和提供的内容（包括但不限于软件、技术、 程序、网页、文字、图片、图像、音频、视频、图表、版面设计、电子文档 等）（“平台内容”）的知识产权属于念熹科技科技所有。
            <br/>
            <br/>
            2.2. 授权使用。平台内容仅限于您以内部管理、援引及参考为目的使用（统称为 “授权使用”）。授权用户可以访问平台，下载、通过电邮发送或打印平台限定数量的资料，或通过平台的保存功能将平台”选定资料保存为限定数量的电子文档。授权使用绝不包括：
           <UL>
            <li>（1）对平台全部或部分资料进行再发行、转发、 出版、转让、商业或其他开发；</li>
            <li>（2）通过对平台资料系统提取而直接或间接 创建或编纂专辑、汇编、数据库或目录。</li>
           </UL>
            <br/>
            <br/>
            2.3. 商标。平台所使用和显示的商标、服务标识、商品名称和标志（统称为“商业标识”）归念熹科技或另行指定的第三方所有。您不得以任何目的复制、 仿造或使用这些商业标识或与这些商业标识整体或部分相似的任何标志。您未被许可或授权使用平台使用或显示的任何商业标识。
            <br/>
            <br/>
            2.4. 超链接。平台内容可能包含指向其他网站或资源的超链接。念熹科技对通过这些链接而访问到的任何第三方资料或资源不承担任何责任。您与第三方发生的任何交易均与念熹科技无关。请查阅任何链接网站的条款和条件以及隐私政策，它们可能与我们的相关规定不同。
            <br/>
            <br/>
            <h4>3.付费项目</h4>
            您使用念熹科技的收费服务时，应当按照念熹科技的要求支付相应的费用。而且，该等权利属于念熹科技的经营自主权，念熹科技保留随时更改经营模式的权利， 即保留变更收费的费率标准、收费的软件功能、收费对象及收费时间等权利。
            <br/>
            <br/>
            <h4> 4.试用</h4>
            <UL>
             如果您根据念熹科技的其他授权使用服务（或访问平台内容），那么您只能以评价其适用性为目的使用。您的试用须遵守本协议以及其他服务条款，包括但不限于“授权使用及限制”条款。试用期结束时，您应该：
            <li>（1）停止使用服务；</li>
            <li>（2）从您的计算机系统删除所有从平台下载的内容或数据，并将储存于其他计算机系统的该等内容删除；</li>
            <li>（3）将您所持有的含有该等内容的物理复件自行销毁或交回念熹科技，所产生的费用由您承担。</li>
            </UL>
            <h4>5.匿名使用</h4>
            如果您以匿名方式使用服务，或者换言之，您是“访客用户”，您只能以信息查询为目的使用服务。您仅有权阅读平台上的信息和资料。您的使用必须遵守本协议以及其他服务条款，包括但不限于其中的所有限制条款。
                <br/>
                <br/>
            <h4>6.用户行为规范</h4>
            您应当对您使用服务的行为负责，除非法律允许或者经念熹科技事先书面许可， 您使用服务不得具有下列行为：
                <br/>
                <br/>
            6.1. 以任何理由访问或企图访问念熹科技的计算机系统区域或其他系统信息（除非根据“订阅协议”，您已经明确被允许访问与平台有关的特定部分）。
                <br/>
                <br/>
            6.2. 以任何目的使用网络爬虫或其他自动下载程序或设备，从事包括但不限于从平台获取他人邮寄或电子邮件地址而发送任何未经请求或授权的商业广告的行为。
            <br/>
            <br/>

            6.3. 使用未经公司授权或许可的任何插件、外挂、系统或第三方工具对平台及相关服务的正常运行进行干扰、破坏、修改或施加其他影响。
            <br/>
            <br/>

             6.4. 利用或针对平台及相关服务进行任何危害计算机网络安全的行为，包括但不限于：
            <UL>
            <li>（1）非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络 安全的活动；</li>
            <li>（2）提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络 数据等危害网络安全活动的程序、工具；</li>
            <li>（3）明知他人从事危害网络安全的活动的，为其提供技术支持、广告推广、 支付结算等帮助；</li>
            <li>（4）使用未经许可的数据或进入未经许可的服务器/账号；</li>
            <li>（5）未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加 存储信息；</li>
            <li>（6）未经许可，企图探查、扫描、测试系统或网络的弱点或其它实施破坏网 络安全的行为；</li>
            <li>（7）企图干涉、破坏平台的正常运行，故意传播恶意程序或病毒以及其他破 坏干扰正常网络信息服务的行为；</li>
            <li>（8）伪造TCP/IP数据包名称或部分名称；</li>
            <li>（9）对平台及服务进行反向工程、反向汇编、编译或者以其他方式尝试发现本软件的源代码；</li>
            <li>（10）恶意注册平台的账号，包括但不限于频繁、批量注册账号；</li>
            <li>（11）将合成内容谎称为自然内容；</li>
            <li>（12）违反法律法规、本协议、公司的相关规则及侵犯他人合法权益的其他行为。</li>
            </UL>


            6.5. 使用平台输入、上传、合成、发布、传播、出版或散发任何含有下列内容之一的信息：
             <UL>
                <li>（1） 反对宪法所确定的基本原则的；</li>
                <li>（2） 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</li>
                <li>（3） 损害国家荣誉和利益的；</li>
                <li>（4） 煽动民族仇恨、民族歧视、破坏民族团结的；</li>
                <li>（5） 破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
                <li>（6） 散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
                <li>（7） 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</li>
                <li>（8） 侮辱或者诽谤他人，侵害他人合法权利的；</li>
                <li>（9） 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；</li>
                <li>（10） 虚假新闻信息；</li>
                <li>（11） 含有中国或其您所在国国家管辖法所适用的法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。</li>
                <li>（12）您应当对使用本服务是否符合法律法规规定进行必要审查，并由您承担由此产生的所有责任。</li>
             </UL>
            6.6. 您使用的服务（包括免费版和收费版），仅限于您个人自行使用，不得以任何形式、在任何平台或通过任何社交软件进行转卖，亦不得采用爬虫或其他任何方式调用念熹科技平台提供的服务。
                <br/>
                <br/>
            6.7 您提供的个人信息不具备真实性、有效性或完整性（如需）；
                <br/>
                <br/>
            6.8 如果我们有理由认为您的行为违反或可能违反上述约定的，我们可独立进行判断并处理，且有权在不事先通知的情况下终止向您提供服务，并追究相关法律责任。
                <br/>
                <br/>
            <h4>7. 免责声明</h4>

            7.1. 平台所包含的由念熹科技或任何另行明示的第三方所提供的信息资料，无意且并不构成法律意见或替代恰当的法律咨询，不存在律师当事人关系。除非您另行特别指明外，向平台提交的任何材料亦不会作为保密材料对待。
                <br/>
                <br/>

            7.2. 我们不做任何形式的下列保证：
            <UL>
                <li>（1）向用户提供的服务是连续的、及时的、准确的；</li>
                <li>（2）缺陷一定会被及时修复；</li>
                <li>（3）所提供的服务或服务器不受病毒或黑客侵袭或受其它故障影响；</li>
                <li>（4）服务会达到您的要求或符合某一特殊目的。</li>
            </UL>
            7.3. 您确认并知悉，使用本平台服务所生成的内容均由人工智能概率模型生成，念熹科技对其生成内容的准确性、完整性和功能性不做任何保证，并且其生成的内容均不代表我们的态度或观点。特别是其中包含的数字、时间等内容，不保证正确，请您自行核实后再进行使用。
                <br/>
                <br/>
            7.4. 对于用户使用本服务生成的文字，念熹科技不限制用户的使用方式或范围。但是，用户为其生成的文字负责，应合法、合理使用。在任何情况下，念熹科技或任何明示的第三方服务提供者或其董事、职员、雇员、分包商、代理商、继承人、受让人、关联方或下属机构，均不就任何因使用该等文字而产生的任何直接、特殊、间接、附带、后果性、惩罚性或其他损失、成本、费用或损害对您或任何其他第三方承担责任。若因用户使用该文字而产生任何违法、破坏公共秩序或侵犯他人合法权益等后果，均由用户自己负责。
                <br/>
                <br/>
            7.5. 念熹科技将不承担以下责任：
             <UL>
               <li>（1）任何由于计算机病毒、或其他恶意软件、程序、代码等以任何方式对您的计算机系统造成的任何负面影响，或造成您的系统崩溃或出现其他技术问题；或</li>
               <li>（2）在提供或访问平台过程中使用任何第三方服务，该第三方的任何行为、疏忽或过失。</li>
           </UL>
            7.6.在任何情况下，对于使用或未能使用平台或平台内容而导致的间接性的、特殊的、附带的、惩罚性的、后果性的损失，或者由此造成的利润损失、数据丢失或业务中断等损失，无论以何种形式提起诉讼，即无论基于民法典、侵权法（包括但不限于过失）还是其他任何法律理论，亦无论是否已被告知该等损失的可能性，念熹科技或任何明示的第三方服务提供者或其董事、职员、 雇员、分包商、代理商、继承人、受让人、关联方或下属机构，均不承担责任。
                <br/>
                <br/>
            7.7.尽管您在自担风险的情况下登录平台或使用服务，若需要念熹科技对于由服务条款或您对使用服务而产生的或与其相关的损失、伤害或损害承担责任， 则念熹科技对任何及所有索赔的赔偿总额不应超过之前六个月期间在您订阅平台所缴纳费用中所占份额。您承认本限制条款为您访问平台和使用服务的前提条件。
                <br/>
                <br/>
            <h4>8.广告</h4>

            8.1.您理解并同意，在使用服务过程中我们可能会向您展示念熹科技、其关联方以及第三方产品和服务的广告和推广信息。此类广告和推广信息的内容可能会以您使用服务中所展示的偏好、兴趣为基础向您推送。
                <br/>
                <br/>
            8.2.我们依照法律规定履行广告及推广相关义务，您应当自行判断该广告或推广信息的真实性和可靠性并为自己的判断行为负责。除法律法规明确规定外， 您因该广告或推广信息进行的购买、交易或因前述内容遭受的损害或损失由您自行承担，念熹科技不予承担责任。
                <br/>
                <br/>
            8.3.平台广告的方式、模式和范围如有变更，恕不另行通知。
                <br/>
                <br/>
            <h4>9.违约处理</h4>

            9.1.针对您违反本协议或其他服务条款的行为，我们有权独立判断并视情况采取预先警示、拒绝发布、立即停止传输信息、删除跟帖、短期禁止发言、限制账号部分或者全部功能直至永久关闭账号等措施。我们有权公告处理结果， 且有权根据实际情况决定是否恢复相关账号的使用。对涉嫌违反法律法规、涉嫌违法犯罪的行为将保存有关记录，并依法向有关主管部门报告、配合有关主管部门调查。
                <br/>
                <br/>
            9.2.您同意针对以下情况引起或导致的索赔、诉因、诉讼、开庭、损失、损害赔偿、费用和支出（包括合理的法律和会计费用）将为念熹科技，其关联方以 及其各自的董事、职员、雇员、分包商、继承人、受让人或下属提供辩护、 赔偿及使其免受损害：（1）您违反了本服务条款或“订阅协议”；（2）您提供了不完整的或不准确的信息或数据；（3）您上传或粘贴于平台的任何内容。 念熹科技保留自行决定承担或参与可以得到赔偿的诉讼或索赔的调查、处理和辩护，费用由您负责。未经念熹科技事先书面同意，不得擅自解决任何索赔，除非这些解决方案完全免除了念熹科技的所有责任，并且不包括或要求念熹科技作出任何支付或救济。
                <br/>
                <br/>
            9.3.我们尊重并保护用户及他人的知识产权、名誉权、姓名权、隐私权等合法权益。您保证，在使用服务时上传以及输入的内容不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权等权利及合法权益。同时您同意并承诺，您使用本服务所提供、使用的文本内容已获得了充分、必要且有效的合法许可及授权。否则， 我们有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应自行处理并承担全部可能由此引起的法律责任；如因您的侵权行为导致公司及其关联公司遭受损失的（包括经济、商誉等损失），您还应足额赔偿我们及其关联公司遭受的全部损失。
                <br/>
                <br/>
            <h4>10.法律适用和管辖</h4>

            10.1.本协议的成立、生效、履行、解释及争议的解决均应适用中华人民共和国法律。若本协议之任何规定因与中华人民共和国的法律抵触而无效或不可执行，则这些条款将尽可能按照接近本协议原条文意旨重新解析，且本协议其它规定仍应具有完整的效力及效果。
                <br/>
                <br/>
            10.2.您与念熹科技发生任何因本协议引起的或与本协议有关的争议，双方应尽量友好协商解决；经友好协商无法解决的，均提请北京仲裁委员会／北京国际仲裁中心按照其仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。

                <br/>
                <br/>
            <h4>11.本协议的更新</h4>

            我们会适时对本协议进行修订，这些修订构成本协议的一部分。本协议更新后，我们会在平台发出更新版本，并在更新后的条款生效前通过平台公告或其他适当的方式提醒您更新的内容，以便您及时了解本协议的最新版本，你也可以在平台首页查阅最新版本的协议条款。如您继续使用服务，表示同意接受修订后的本协议的内容。
                <br/>
                <br/>
            <h4>12.反馈渠道</h4>

            如用户对本协议或使用念熹智语的相关事宜有任何问题、投诉、举报、意见或建议，可发送电子邮件至support@nianxi.cc，或拨打客服电话：+86 18601106333。
                <br/>
                <br/>
        </Container>
    )
}


const Container = styled.div`
  text-align: left;
  width: 60vw;
  line-height: 25px;
  overflow-y: auto;
  margin: 0 auto;
  background-color: #fff;
`

const UL = styled.ul`
  list-style-type: none;
  margin:0px;
  padding: 0px;
`
